package L3.CanesVenatici.EyeofSauron;

public class BlackHole1 {
}

NGC 4151 (также известная как Око Саурона, Eye of Sauron[4]) — спиральная галактика с перемычкой (тип SBa) в созвездии Гончих Псов. Сейфертовская галактика, относится к шести «классическим» сейфертовским галактикам, описанным в пионерской работе Карла Сейферта[5]. Одна из самых ярких и близких к нам активных галактик.
        Существуют исследования, указывающие на наличие в центре галактики не одной, а двух сверхмассивных чёрных дыр с массами 40 млн и 10 млн масс Солнца, находящихся на расстоянии менее парсека друг от друга и обращающихся вокруг общего центра тяжести с периодом обращения 16 лет[6]. Также в галактике фиксируется избыточное излучение радиолинии CO[7].
        При хороших погодных условиях вполне доступна для наблюдений любителями астрономии с телескопами диаметром от 70 мм[1].